<template>
    <div>
        我已估价页面
        <chart :options="chartOptions" :style="{width:'900px',height:'500px'}"></chart>
    </div>
</template>

<script>
    import {getAxios} from "../utils/AjaxUtils";
    export default {
        name: "Evaluated",
        data:function(){
            let data = [
                {"日期":"2018/2/1","计划":"285.9 ","已完成":"256.9 ","未完成":"29.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/2","计划":"287.4 ","已完成":"258.3 ","未完成":"29.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/3","计划":"289.1 ","已完成":"260.1 ","未完成":"29.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/4","计划":"277.6 ","已完成":"248.6 ","未完成":"29.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/5","计划":"285.0 ","已完成":"256.0 ","未完成":"29.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/6","计划":"275.2 ","已完成":"246.1 ","未完成":"29.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/7","计划":"282.6 ","已完成":"253.4 ","未完成":"29.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/8","计划":"317.3 ","已完成":"287.7 ","未完成":"29.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/9","计划":"330.1 ","已完成":"300.1 ","未完成":"30.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/10","计划":"351.5 ","已完成":"320.5 ","未完成":"31.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/11","计划":"356.7 ","已完成":"325.6 ","未完成":"31.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/12","计划":"340.2 ","已完成":"309.1 ","未完成":"31.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/13","计划":"353.9 ","已完成":"322.9 ","未完成":"31.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/14","计划":"350.7 ","已完成":"319.8 ","未完成":"30.9 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/15","计划":"353.3 ","已完成":"321.9 ","未完成":"31.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/16","计划":"353.3 ","已完成":"321.9 ","未完成":"31.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/17","计划":"350.3 ","已完成":"318.9 ","未完成":"31.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/18","计划":"350.3 ","已完成":"318.9 ","未完成":"31.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/19","计划":"350.3 ","已完成":"318.9 ","未完成":"31.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/20","计划":"350.3 ","已完成":"318.9 ","未完成":"31.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/21","计划":"376.1 ","已完成":"344.5 ","未完成":"31.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/22","计划":"357.9 ","已完成":"326.2 ","未完成":"31.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/23","计划":"357.9 ","已完成":"326.2 ","未完成":"31.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/24","计划":"357.5 ","已完成":"325.9 ","未完成":"31.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/25","计划":"355.2 ","已完成":"323.5 ","未完成":"31.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/26","计划":"361.2 ","已完成":"325.0 ","未完成":"36.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/27","计划":"340.5 ","已完成":"304.2 ","未完成":"36.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/2/28","计划":"353.4 ","已完成":"316.4 ","未完成":"37.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/1","计划":"373.9 ","已完成":"336.9 ","未完成":"37.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/2","计划":"430.2 ","已完成":"380.2 ","未完成":"50.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/3","计划":"437.7 ","已完成":"387.6 ","未完成":"50.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/4","计划":"483.5 ","已完成":"433.3 ","未完成":"50.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/5","计划":"477.5 ","已完成":"427.3 ","未完成":"50.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/6","计划":"528.7 ","已完成":"450.5 ","未完成":"78.3 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/7","计划":"540.7 ","已完成":"462.2 ","未完成":"78.5 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/8","计划":"534.6 ","已完成":"455.7 ","未完成":"78.9 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/9","计划":"511.9 ","已完成":"433.0 ","未完成":"78.9 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/10","计划":"512.3 ","已完成":"433.3 ","未完成":"79.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/11","计划":"511.3 ","已完成":"432.4 ","未完成":"79.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/12","计划":"516.9 ","已完成":"437.5 ","未完成":"79.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/13","计划":"522.8 ","已完成":"443.2 ","未完成":"79.6 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/14","计划":"531.8 ","已完成":"451.5 ","未完成":"80.3 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/15","计划":"569.2 ","已完成":"481.9 ","未完成":"87.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/16","计划":"569.2 ","已完成":"481.9 ","未完成":"87.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/17","计划":"618.2 ","已完成":"525.4 ","未完成":"92.8 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/18","计划":"621.2 ","已完成":"526.9 ","未完成":"94.3 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/19","计划":"557.3 ","已完成":"462.4 ","未完成":"94.9 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/20","计划":"533.6 ","已完成":"439.5 ","未完成":"94.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/21","计划":"529.8 ","已完成":"435.7 ","未完成":"94.1 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/22","计划":"528.9 ","已完成":"426.7 ","未完成":"102.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/23","计划":"525.2 ","已完成":"423.0 ","未完成":"102.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/24","计划":"521.0 ","已完成":"416.7 ","未完成":"104.3 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/25","计划":"612.6 ","已完成":"414.8 ","未完成":"197.8 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/26","计划":"610.8 ","已完成":"412.9 ","未完成":"197.8 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/27","计划":"607.2 ","已完成":"409.4 ","未完成":"197.8 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/28","计划":"629.3 ","已完成":"409.4 ","未完成":"220.0 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/29","计划":"643.6 ","已完成":"368.4 ","未完成":"275.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/30","计划":"657.6 ","已完成":"352.4 ","未完成":"305.2 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
                {"日期":"2018/3/31","计划":"663.2 ","已完成":"351.9 ","未完成":"311.4 ","区域产能":"957.0 ","共享产能":"100","总产能":"1057.0 "},
            ];
            let xAxisData = [],seriePlan = [],serieFinish = [],serieUnFinish = [],seriePart = [],serieShare = [],serieAll = [];
            for(let i in data){
                let item = data[i];
                xAxisData.push(item["日期"]);
                seriePlan.push(item["计划"]);
                serieFinish.push(item["已完成"]);
                serieUnFinish.push(item["未完成"]);
                seriePart.push(item["区域产能"]);
                serieShare.push(item["共享产能"]);
                serieAll.push(item["总产能"]);
            }
            let zoomEnd = 100;
            if(data.length>8){
                zoomEnd = Math.ceil(800/data.length);
            }
            return {
                chartOptions: {
                    tooltip: {
                        trigger: 'axis',
                        axisPointer: {
                            type: 'cross',
                            crossStyle: {
                                color: '#999'
                            }
                        }
                    },
                    color:["#3968BC","#F2BB2E","#5693CA","#E6742B","#9F9F9F"],
                    backgroundColor: '#2c343c',
                    toolbox: {
                        feature: {
                            dataView: {show: true, readOnly: false},
                            magicType: {show: true, type: ['line', 'bar']},
                            restore: {show: true},
                            saveAsImage: {show: true}
                        }
                    },
                    legend: {
                        left:"2.5%",
                        top:"middle",
                        orient:'vertical',
                        data:['区域产能','共享产能','计划','已完成','未完成'],
                        textStyle:{
                            color:"#ffffff"
                        },
                    },
                    grid:{
                        left:'20%',
                        right:'5%',
                    },
                    xAxis: [
                        {
                            type: 'category',
                            name: '日期',
                            data: xAxisData,
                            axisPointer: {
                                type: 'shadow'
                            },
                            axisLabel: {
                                color:"#ffffff"
                            },
                            nameTextStyle:{
                                color:"#ffffff"
                            },
                        }
                    ],
                    yAxis: [
                        {
                            type: 'value',
                            name: '产能',
                            axisLabel: {
                                formatter: function (value,index){
                                    let newVal = value.toFixed(1);
                                    return newVal
                                },
                                color:"#ffffff"
                            },
                            nameTextStyle:{
                                color:"#ffffff"
                            },
                        },
                    ],
                    series: [
                        {
                            name:'区域产能',
                            type:'bar',
                            stack:"capacity",
                            data:seriePart,
                            label:{
                                show:true,
                                color:"#fff"
                            }
                        },
                        {
                            name:'共享产能',
                            type:'bar',
                            stack:"capacity",
                            data:serieShare,
                            label:{
                                show:true,
                                color:"#fff"
                            }
                        },
                        {
                            name:'计划',
                            type:'line',
                            data:seriePlan,
                            label:{
                                show:true,
                                color:"#fff"
                            }
                        },
                        {
                            name:'已完成',
                            type:'line',
                            data:serieFinish,
                            label:{
                                show:true,
                                color:"#fff"
                            }
                        },
                        {
                            name:'未完成',
                            type:'line',
                            data:serieUnFinish,
                            label:{
                                show:true,
                                color:"#fff"
                            }
                        }
                    ],
                    dataZoom:[{
                        type:'slider',
                        start:0,
                        end:zoomEnd,
                    }]
                }
            }
        },
        computed:{

        },
        methods:{
            renderChart:function () {
                // let myChart = echarts.init(document.getElementById('myChart'));
            }
        },
        mounted:async function (){
            // let chartData = await getAxios("/getChartData");
        }
    }
</script>

<style scoped>

</style>